src/main/resources/xml/experienceMediaServiceV1/replace/replace.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.experiencemediav1.fulfillment.lodging.bussvcs.wdpr.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:replace>
         <request locationId="?" encoderId="?" overrideMediaIdsRetrieve="?">
            <!--1 or more repetitions:-->
            <replaceMediaRequestDetails travelComponentGroupingId="?" facilityId="?" txnGuestId="?" secondaryStatus="?">
               <experienceMediaIdReference mediaId="?" mediaType="?"/>
            </replaceMediaRequestDetails>
         </request>
         <context>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </context>
      </ser:replace>
   </soapenv:Body>
</soapenv:Envelope>
